#ifndef C_DIZZY_H
#define C_DIZZY_H

//****************************************************************************************************
//Класс Диззи
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <stdint.h>
#include <vector>

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//Класс Диззи
//****************************************************************************************************
class CDizzy
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //режимы движения Диззи
  enum MOVE
  {
   MOVE_STOP,
   MOVE_LEFT,
   MOVE_RIGHT,
   MOVE_JUMP,
   MOVE_JUMP_LEFT,
   MOVE_JUMP_RIGHT,
  };
  //-структуры------------------------------------------------------------------------------------------
  //кадры анимации Диззи
  struct SFrame
  {   
   MOVE Move;//режим движения
   int32_t ImageFrame;//номер кадра в изображении
   SFrame *sFrame_Next_Ptr;//указатель на следующий кадр
   bool EndFrame;//является ли кадр последним кадром
   
   SFrame(int32_t image_frame,MOVE move,bool end_frame=false,SFrame *next_ptr=NULL)
   { 
    Move=move;
	ImageFrame=image_frame;
	sFrame_Next_Ptr=next_ptr;
	EndFrame=end_frame;
   }
  };
  //-константы------------------------------------------------------------------------------------------

  //-переменные-----------------------------------------------------------------------------------------
  SFrame *sFrame_Stop_Ptr;//указатель на последовательность анимации "Диззи стоит"
  SFrame *sFrame_MoveLeft_Ptr;//указатель на последовательность анимации "Диззи идёт влево"
  SFrame *sFrame_MoveRight_Ptr;//указатель на последовательность анимации "Диззи идёт вправо"
  SFrame *sFrame_Jump_Ptr;//указатель на последовательность анимации "Диззи прыгает на месте"
  SFrame *sFrame_JumpLeft_Ptr;//указатель на последовательность анимации "Диззи прыгает влево"
  SFrame *sFrame_JumpRight_Ptr;//указатель на последовательность анимации "Диззи прыгает вправо"

  SFrame *sFrame_Ptr;//указатель на текущий кадр анимации
 private:
  //-переменные-----------------------------------------------------------------------------------------
  std::vector<SFrame> sFrame_Array;//набор кадров для анимации Диззи
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CDizzy(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CDizzy();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void Animation(void);//анимация Диззи
  void Init(void);//инициализация Диззи
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
};

#endif