#ifndef C_TILES_SEQUENCE_H
#define C_TILES_SEQUENCE_H

//****************************************************************************************************
//класс последовательности тайлов для кусочка карты
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <stdint.h>
#include <fstream>
#include <vector>

#include "ctile.h"

//****************************************************************************************************
//макроопределения
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объявления
//****************************************************************************************************

//****************************************************************************************************
//класс последовательности тайлов для кусочка карты
//****************************************************************************************************
class CTilesSequence
{
 public:
  //-перечисления---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  //-переменные-----------------------------------------------------------------------------------------
 private:
  //-переменные-----------------------------------------------------------------------------------------
  std::vector<CTile> cTile_Sequence;//набор тайлов
  size_t CurrentIndex;//текущий индекс тайла
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CTilesSequence(const CTile &cTile=CTile(0,0));
  //-деструктор-----------------------------------------------------------------------------------------
  ~CTilesSequence();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  bool Save(std::ofstream &file);//записать
  bool Load(std::ifstream &file);//сохранить
  void Clear(void);//удалить все элементы
  void AddNewTile(const CTile &cTile);//добавить новый тайл
  CTile& GetTile(size_t index);//получить тайл
  size_t GetSize(void);//получить количество тайлов
  size_t GetCurrentIndex(void);//получить текущий индекс тайла
  void ToNextTile(void);//перейти к следующему индексу тайла
  void ResetCurrentIndex(void);//сбросить текущий индекс тайла
  std::vector<CTile>* GetItemPtr(void);//получить указатель на список тайлов
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
};

#endif
