#ifndef C_WND_MAIN_H
#define C_WND_MAIN_H

//****************************************************************************************************
//√лавный класс программы
//****************************************************************************************************

//****************************************************************************************************
//подключаемые библиотеки
//****************************************************************************************************
#include <windows.h>
#include "ivideo.h"
#include "cgame.h"
#include <memory>
#include <stdint.h>

//****************************************************************************************************
//макроопределени€
//****************************************************************************************************

//****************************************************************************************************
//константы
//****************************************************************************************************

//****************************************************************************************************
//предварительные объ€влени€
//****************************************************************************************************

//****************************************************************************************************
//√лавный класс программы
//****************************************************************************************************
class CWnd_Main
{
 public:
  //-перечислени€---------------------------------------------------------------------------------------
  //-структуры------------------------------------------------------------------------------------------
  //-константы------------------------------------------------------------------------------------------
  static const size_t TIMER_ID=1000;//идентификатор таймера
  static const int32_t FPS=33;//частота кадров
 private:
  //-переменные-----------------------------------------------------------------------------------------
  HWND hWnd;//дескриптор окна
  std::unique_ptr<IVideo> iVideo_Ptr;//указатель на класс видеоэкрана
  std::unique_ptr<CGame> cGame_Ptr;//указатель на класс игры
  bool Enabled;//разрешена ли работа игры

  bool Active;//активно ли окно
 public:
  //-конструктор----------------------------------------------------------------------------------------
  CWnd_Main(void);
  //-деструктор-----------------------------------------------------------------------------------------
  ~CWnd_Main();
 public:
  //-открытые функции-----------------------------------------------------------------------------------
  void Create(HWND hWnds,WPARAM wParam,LPARAM lParam);//создание окна
  void Destroy(HWND hWnds,WPARAM wParam,LPARAM lParam);//уничтожени€ окна
  void Paint(HWND hWnds,WPARAM wParam,LPARAM lParam);//рисование окна  
  void Timer(HWND hWnds,WPARAM wParam,LPARAM lParam);//таймер
  void Processing(void);//создание кадра изображени€
 private:
  //-закрытые функции-----------------------------------------------------------------------------------  
 public:
  //статические функции---------------------------------------------------------------------------------
  static void Register(void);//зарегистировать класс окна
  static long WINAPI WNDProc(HWND hWnd,UINT msg,WPARAM wParam,LPARAM lParam);//функци€ обратного вызова окна
};

#endif