#include "stdafx.h"
//------------------------------------------------------------------------------
#include "cwnd_main.h"
//------------------------------------------------------------------------------
class CWinApp_Main:public CWinApp
{
 protected:
  //-Переменные класса-------------------------------------------------------
  //-Функции класса----------------------------------------------------------
  //-Прочее------------------------------------------------------------------
 public:
  //-Конструктор класса------------------------------------------------------
  CWinApp_Main(void);
  //-Деструктор класса-------------------------------------------------------
  ~CWinApp_Main();
  //-Переменные класса-------------------------------------------------------
  //-Замещённые функции предка-----------------------------------------------
  BOOL InitInstance(void);
  //-Новые функции класса----------------------------------------------------
  //-Функции обработки сообщений класса--------------------------------------
  //-Новые функции класса----------------------------------------------------
  //-Прочее------------------------------------------------------------------
};
//-Конструктор класса--------------------------------------------------------
CWinApp_Main::CWinApp_Main(void)
{
}
//-Деструктор класса---------------------------------------------------------
CWinApp_Main::~CWinApp_Main()
{
}
//-Замещённые функции предка-------------------------------------------------
BOOL CWinApp_Main::InitInstance(void)
{
 CWnd_Main *cWnd_Main=new CWnd_Main;
 HCURSOR hCursor=LoadStandardCursor(IDC_ARROW);
 HICON hIcon=LoadStandardIcon(IDI_APPLICATION);
 HBRUSH hBrush=(HBRUSH)COLOR_WINDOW;
 LPCSTR ClassName=AfxRegisterWndClass(CS_HREDRAW|CS_VREDRAW,hCursor,hBrush,hIcon);
 //определим размер окна по заданной клиентской области
 RECT Rect;
 Rect.left=0;
 Rect.right=320;
 Rect.top=0;
 Rect.bottom=240;
 AdjustWindowRect(&Rect,WS_OVERLAPPED|WS_CAPTION|WS_SYSMENU|WS_MINIMIZEBOX,FALSE);
 cWnd_Main->CreateEx(0,ClassName,"Dizzy",WS_OVERLAPPED|WS_CAPTION|WS_SYSMENU|WS_MINIMIZEBOX,0,0,Rect.right-Rect.left,Rect.bottom-Rect.top,NULL,NULL);
 cWnd_Main->ShowWindow(m_nCmdShow);
 m_pMainWnd=cWnd_Main;
 return TRUE;
}
//-Новые функции класса------------------------------------------------------
//-Функции обработки сообщений класса----------------------------------------
//-Новые функции класса------------------------------------------------------
//-Прочее--------------------------------------------------------------------
CWinApp_Main cWinApp_Main;


